app/views/index/results.html.erb

SELECT "groups".* FROM "groups"
---
<div class="results">
  <%= select_tag 'groups', options_for_select(@groups.collect{ |u| [u.name, u.name] }), :prompt => "Allir flokkar" %>

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    %>
      <div class="flex-item-1 flex-child-column competitor" data-result-id="<%= competitor.id %>" data-group="<%= competitor.group.name %>">

SELECT "laptimes".* FROM "laptimes" WHERE "laptimes"."competitor_id" = $1  [["competitor_id", 1]]
---
        <div class="flex-item-1 flex-child-column laptimes" style="display:none">
          <% competitor.laptimes.each do |lap| %>

SELECT "competitors".* FROM "competitors"
---
<script type="text/javascript">
  $(function() {
    $('.competitor').on('click', function() {
      var laptimesDiv = $(this).find('.laptimes');
      if ( laptimesDiv.is(":visible")){
        laptimesDiv.toggle('fast');
      } else {
        laptimesDiv.toggle('fast');
      }
    });

    $('#groups').on('change', function() {
      var selectedValue = $(this).val();
      var counter = 1;
      $('.competitor').each(function() {
        if ($(this).attr('data-group') === selectedValue || selectedValue === '') {
          $(this).show();
          $(this).find('.counting-place').text(counter);
          counter++;
        } else {
          $(this).hide();
        }