app/views/groups/show.html.erb

</p>
<% @group.competitors.each do |competitor| %>
---
SELECT "competitors".* FROM "competitors" WHERE "competitors"."group_id" = $1  [["group_id", 1]]