app/views/competitors/index.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        <td><%= competitor.name %></td>
        <td><%= competitor.group %></td>