app/controllers/competitors_controller.rb

SELECT "competitors".* FROM "competitors"
---
  def index
    @competitors = Competitor.all

SELECT  "competitors".* FROM "competitors" WHERE "competitors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_competitor
      @competitor = Competitor.find(params[:id])