app/controllers/index_controller.rb

SELECT "groups".* FROM "groups"
---
  def signup
    @groups = Group.all

SELECT "groups".* FROM "groups"
SELECT "competitors".* FROM "competitors"
---
  def results
    @groups = Group.all
    @competitors = Competitor.all