app/controllers/laptimes_controller.rb

  def index
    @laptimes = Laptime.all
---
SELECT "laptimes".* FROM "laptimes"